Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/H12B.tmx
Source language: en_us
Languages: zh_cn

source: The British Museum was established in 1753, largely based on the collections of the physician and scientist Sir Hans Sloane.
zh_cn: 大英博物馆在内科医师、科学家汉斯·斯隆的私人收藏品基础上成立于1753年。

source: The museum first opened to the public on 15 January 1759 in Montagu House in Bloomsbury, on the site of the current museum building.
zh_cn: 大英博物馆于1950年1月15日在蒙塔古大楼首次对外开放。

source: Its expansion over the following two and a half centuries has resulted in the creation of several branch institutions, the first being the British Museum of Natural History in South Kensington in 1887.
zh_cn: 在接下来的两个半世纪里，大英博物馆不断扩展，最后形成了几个分馆，它的第一个分馆自然历史博物馆成立于1887年，坐落在南肯辛顿。

source: Until 1997, when the current British Library building opened to the public, replacing the old British Museum Reading Room, the British Museum was unique in that it housed both a national museum of antiquities and a national library in the same building.
zh_cn: 直到1997年大英图书馆对外开放从而取代了大英博物馆旧的阅览室之前，大英博物馆一直都是集国家古董博物馆和国家图书馆双重属性为一身的独一无二的建筑。

source: The Museum was founded 250 years ago as an encyclopedia of nature and of art.
zh_cn: 大英博物馆在250多年前是作为自然和艺术的百科全书建立的。

source: Today it no longer houses collections of natural history, and the books and manuscripts it once held now form part of the independent British Library.
zh_cn: 如今它已不单单是一座大大的自然历史遗留物的收藏屋，它所拥有的书籍与手稿现已成为了独立的大英图书馆的重要组成部分。

source: The Museum nevertheless preserves its universality in its collections of artifacts representing the cultures of the world, ancient and modern.
zh_cn: 然而，大英博物馆保持着它对古今中外各种古董同等的收藏热情。

source: The original 1753 collection has grown to over thirteen million objects at the British Museum, 70 million at the Natural History Museum and 150 million at the British Library.
zh_cn: 大英博物馆已由最初的1753件收藏品增长到现如今的本馆1千300万件藏品，自然历史博物馆7千万藏品和大英图书馆1亿5千万件藏品。

source: The Round Reading Room, which was designed by the architect Sydney Smirke, opened in 1857.
zh_cn: 大英博物馆阅览室是由建筑师悉尼·斯莫克设计的，于1857年对外开放。

source: For almost 150 years researchers came here to consult the Museum's vast library.
zh_cn: 将近150年来，研究员一直在考虑着大英博物馆的浩瀚图书资源问题。

source: The Reading Room closed in 1997 when the national library (the British Library) moved to a new building at St Pancras.
zh_cn: 1997年，大英博物馆阅览室关闭，由其分裂出新的国家图书馆（大英图书馆）迁往圣潘克拉斯新址。

source: Today it has been transformed into the Walter and Leonore Annenberg Centre.
zh_cn: 如今，它已转变成为沃尔特和莱奥诺尔安南伯格中心。

source: This contains the Paul Hamlyn Library of books about the Museum's collections, which is open to all visitors.
zh_cn: 包括了保罗哈姆林图书馆中关于博物馆的藏品，并对公众开放。
